name: "RHDLatentHMMap"

#-----Generate random image index for training 0
layer {
  name: "image_index_0"
  type: "DeepHandModelGenRandIndex"
  top: "image_index_0"
  gen_rand_index_param {
     index_lower_bound: 0
	 index_upper_bound: 10000
	 batch_size: 32
     missing_index_file: "C:\\RHD_v1-1\\RHD_published_v2\\training\\all_hand\\missing_left_new.txt"
  }
  include {
     phase: TRAIN
  }
}




#-----Generate random image index for training 0
layer {
  name: "image_index_1"
  type: "DeepHandModelGenRandIndex"
  top: "image_index_1"
  gen_rand_index_param {
     index_lower_bound: 10001
	 index_upper_bound: 20000
	 batch_size: 32
     missing_index_file: "C:\\RHD_v1-1\\RHD_published_v2\\training\\all_hand\\missing_left_new.txt"
  }
  include {
     phase: TRAIN
  }
}




#-----Generate random image index for training 0
layer {
  name: "image_index_2"
  type: "DeepHandModelGenRandIndex"
  top: "image_index_2"
  gen_rand_index_param {
     index_lower_bound: 20001
	 index_upper_bound: 30000
	 batch_size: 32
     missing_index_file: "C:\\RHD_v1-1\\RHD_published_v2\\training\\all_hand\\missing_left_new.txt"
  }
  include {
     phase: TRAIN
  }
}




#-----Generate random image index for training 0
layer {
  name: "image_index_3"
  type: "DeepHandModelGenRandIndex"
  top: "image_index_3"
  gen_rand_index_param {
     index_lower_bound: 30001
	 index_upper_bound: 40000
	 batch_size: 32
     missing_index_file: "C:\\RHD_v1-1\\RHD_published_v2\\training\\all_hand\\missing_left_new.txt"
  }
  include {
     phase: TRAIN
  }
}





#-----Generate random image index for training 0
layer {
  name: "image_index_4"
  type: "DeepHandModelGenRandIndex"
  top: "image_index_4"
  gen_rand_index_param {
     index_lower_bound: 40001
	 index_upper_bound: 50000
	 batch_size: 32
     missing_index_file: "C:\\RHD_v1-1\\RHD_published_v2\\training\\all_hand\\missing_left_new.txt"
  }
  include {
     phase: TRAIN
  }
}





#-----Generate random image index for training 0
layer {
  name: "image_index_5"
  type: "DeepHandModelGenRandIndex"
  top: "image_index_5"
  gen_rand_index_param {
     index_lower_bound: 50001
	 index_upper_bound: 60000
	 batch_size: 32
     missing_index_file: "C:\\RHD_v1-1\\RHD_published_v2\\training\\all_hand\\missing_left_new.txt"
  }
  include {
     phase: TRAIN
  }
}





#-----Generate random image index for training 0
layer {
  name: "image_index_6"
  type: "DeepHandModelGenRandIndex"
  top: "image_index_6"
  gen_rand_index_param {
     index_lower_bound: 60001
	 index_upper_bound: 70000
	 batch_size: 32
     missing_index_file: "C:\\RHD_v1-1\\RHD_published_v2\\training\\all_hand\\missing_left_new.txt"
  }
  include {
     phase: TRAIN
  }
}




#-----Generate random image index for training 0
layer {
  name: "image_index_7"
  type: "DeepHandModelGenRandIndex"
  top: "image_index_7"
  gen_rand_index_param {
     index_lower_bound: 70001
	 index_upper_bound: 80000
	 batch_size: 32
     missing_index_file: "C:\\RHD_v1-1\\RHD_published_v2\\training\\all_hand\\missing_left_new.txt"
  }
  include {
     phase: TRAIN
  }
}



#-----Generate random image index for training 0
layer {
  name: "image_index_8"
  type: "DeepHandModelGenRandIndex"
  top: "image_index_8"
  gen_rand_index_param {
     index_lower_bound: 80001
	 index_upper_bound: 82515
	 batch_size: 32
     missing_index_file: "C:\\RHD_v1-1\\RHD_published_v2\\training\\all_hand\\missing_left_new.txt"
  }
  include {
     phase: TRAIN
  }
}



#-----Concat the indexes leave image_index_4 out
layer {
  name: "image_index_concat"
  type: "Concat"
  bottom: "image_index_0"
  bottom: "image_index_1"
  bottom: "image_index_2"
  bottom: "image_index_3"
  bottom: "image_index_4"
  bottom: "image_index_5"
  bottom: "image_index_6"
  bottom: "image_index_7"
  bottom: "image_index_8"
  
  top: "image_index_concat"
  include {
     phase: TRAIN
  }
}


#-----Random choose from one index
layer {
  name: "image_index"
  type: "CrossValidationRandomChooseIndex"
  bottom: "image_index_concat"
  top: "image_index"
  include {
     phase: TRAIN
  }
}





#-----Generate random image index for training 0
layer {
  name: "image_index"
  type: "DeepHandModelGenRandIndex"
  top: "image_index"
  gen_rand_index_param {
     index_lower_bound: 0
	 index_upper_bound: 5455
	 batch_size: 32
     missing_index_file: "C:\\RHD_v1-1\\RHD_published_v2\\evaluation\\all_hand\\missing_left_new.txt"
  }
  include {
     phase: TEST
  }
}







#----- Read 
layer {
  name: "readimage"
  type: "ReadImage"
  bottom: "image_index"
  top: "image"
  read_image_param {
     read_path: "C:\\RHD_v1-1\\RHD_published_v2\\training\\all_hand\\crop_image\\"
	 resize_size: 224
	 zero_pad: 0
  }
  include {
     phase: TRAIN
  }
}


#----- Read 
layer {
  name: "readimage"
  type: "ReadImage"
  bottom: "image_index"
  top: "image"
  read_image_param {
     read_path: "C:\\RHD_v1-1\\RHD_published_v2\\evaluation\\all_hand\\crop_image\\"
	 resize_size: 224
	 zero_pad: 0
  }
  include {
     phase: TEST
  }
}


#----- Read raw image index
layer {
  name: "read_raw_image_index"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "raw_image_index"
  read_blob_from_file_indexing_param {
     file_prefix: "C:\\RHD_v1-1\\RHD_published_v2\\training\\all_hand\\image_index\\"
	 num_to_read: 1
  }
  include {
     phase: TRAIN
  }
}


#----- Read raw image index
layer {
  name: "read_raw_image_index"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "raw_image_index"
  read_blob_from_file_indexing_param {
     file_prefix: "C:\\RHD_v1-1\\RHD_published_v2\\evaluation\\all_hand\\image_index\\"
	 num_to_read: 1
  }
  include {
     phase: TEST
  }
}



#----- Read avg bone
layer {
  name: "avg_bone"
  type: "ReadBlobFromFile"
  top: "avg_bone"
  read_blob_from_file_param {
     file_path: "D:\\handpose\\CalcRHDBoneStats\\avg_bone.txt"
	 num_to_read: 20
	 batch_size: 32
  }  
}

#-----read bbx x1
layer {
  name: "bbx_x1"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "bbx_x1"
  read_blob_from_file_indexing_param {
     file_prefix: "C:\\RHD_v1-1\\RHD_published_v2\\training\\all_hand\\bbx_x1\\"
	 num_to_read: 1
  }
  include {
     phase: TRAIN
  }
}

#-----read bbx x1
layer {
  name: "bbx_x1"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "bbx_x1"
  read_blob_from_file_indexing_param {
     file_prefix: "C:\\RHD_v1-1\\RHD_published_v2\\evaluation\\all_hand\\bbx_x1\\"
	 num_to_read: 1
  }
  include {
     phase: TEST
  }
}





#-----read bbx y1
layer {
  name: "bbx_y1"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "bbx_y1"
  read_blob_from_file_indexing_param {
     file_prefix: "C:\\RHD_v1-1\\RHD_published_v2\\training\\all_hand\\bbx_y1\\"
	 num_to_read: 1
  }
  include {
     phase: TRAIN
  }
}

#-----read bbx y1
layer {
  name: "bbx_y1"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "bbx_y1"
  read_blob_from_file_indexing_param {
     file_prefix: "C:\\RHD_v1-1\\RHD_published_v2\\evaluation\\all_hand\\bbx_y1\\"
	 num_to_read: 1
  }
  include {
     phase: TEST
  }
}





#-----read bbx x2
layer {
  name: "bbx_x2"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "bbx_x2"
  read_blob_from_file_indexing_param {
     file_prefix: "C:\\RHD_v1-1\\RHD_published_v2\\training\\all_hand\\bbx_x2\\"
	 num_to_read: 1
  }
  include {
     phase: TRAIN
  }
}

#-----read bbx x2
layer {
  name: "bbx_x2"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "bbx_x2"
  read_blob_from_file_indexing_param {
     file_prefix: "C:\\RHD_v1-1\\RHD_published_v2\\evaluation\\all_hand\\bbx_x2\\"
	 num_to_read: 1
  }
  include {
     phase: TEST
  }
}





#-----read bbx y2
layer {
  name: "bbx_y2"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "bbx_y2"
  read_blob_from_file_indexing_param {
     file_prefix: "C:\\RHD_v1-1\\RHD_published_v2\\training\\all_hand\\bbx_y2\\"
	 num_to_read: 1
  }
  include {
     phase: TRAIN
  }
}

#-----read bbx y2
layer {
  name: "bbx_y2"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "bbx_y2"
  read_blob_from_file_indexing_param {
     file_prefix: "C:\\RHD_v1-1\\RHD_published_v2\\evaluation\\all_hand\\bbx_y2\\"
	 num_to_read: 1
  }
  include {
     phase: TEST
  }
}


#----gen bbx_x2 - bbx_x1 
layer {
  bottom: "bbx_x1"
  top: "neg_bbx_x1"
  type: "ScaleVector"
  name: "neg_bbx_x1"
  scale_vector_param {
     scale_factor: -1.0
  }
}


#----gen bbx_y2 - bbx_y1 
layer {
  bottom: "bbx_y1"
  top: "neg_bbx_y1"
  type: "ScaleVector"
  name: "neg_bbx_y1"
  scale_vector_param {
     scale_factor: -1.0
  }
}

layer {
  bottom: "bbx_x2"
  bottom: "neg_bbx_x1"
  top: "width"
  name: "width"
  type: "Eltwise"
}


layer {
  bottom: "bbx_y2"
  bottom: "neg_bbx_y1"
  top: "height"
  name: "height"
  type: "Eltwise"
}



#-----read camera k 3*3
layer {
  name: "read_camera_k"
  type: "ReadBlobFromFileIndexing"
  bottom: "raw_image_index"
  top: "camera_k"
  read_blob_from_file_indexing_param {
     file_prefix: "C:\\RHD_v1-1\\RHD_published_v2\\training\\matlab_gt_camera_k\\"
	 num_to_read: 9
  }
  include {
     phase: TRAIN
  }
}

#-----read camera k 3*3
layer {
  name: "read_camera_k"
  type: "ReadBlobFromFileIndexing"
  bottom: "raw_image_index"
  top: "camera_k"
  read_blob_from_file_indexing_param {
     file_prefix: "C:\\RHD_v1-1\\RHD_published_v2\\evaluation\\matlab_gt_camera_k\\"
	 num_to_read: 9
  }
  include {
     phase: TEST
  }
}



#-----slice to fx 0 u0 0 fy v0 0 0 1
layer {
  name: "slice_camera_k"
  bottom: "camera_k"
  top: "fx"
  top: "zero_0"
  top: "u0"
  top: "zero_1"
  top: "fy"
  top: "v0"
  top: "zero_2"
  top: "zero_3"
  top: "one"
  type: "Slice"
  slice_param {
     axis: 1
	 slice_point: 1
	 slice_point: 2
	 slice_point: 3
	 slice_point: 4
	 slice_point: 5
	 slice_point: 6
	 slice_point: 7
	 slice_point: 8
  }
}

layer {
  bottom: "zero_0"
  bottom: "zero_1"
  top: "nothing_0"
  name: "nothing_0"
  type: "EuclideanLoss"
  loss_weight: 0.0
}

layer {
  bottom: "zero_2"
  bottom: "zero_3"
  top: "nothing_1"
  name: "nothing_1"
  type: "EuclideanLoss"
  loss_weight: 0.0
}

layer {
  bottom: "zero_2"
  bottom: "one"
  top: "nothing_2"
  name: "nothing_2"
  type: "EuclideanLoss"  
  loss_weight: 0.0
}

#----- Read crop gt 2d
layer {
  name: "read_gt_2d"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "gt_joint_2d"
  read_blob_from_file_indexing_param {
     file_prefix: "C:\\RHD_v1-1\\RHD_published_v2\\training\\all_hand\\crop_gt_2d\\"
	 num_to_read: 42
  }
  include {
     phase: TRAIN
  }
}


#----- Read crop gt 2d
layer {
  name: "read_gt_2d"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "gt_joint_2d"
  read_blob_from_file_indexing_param {
     file_prefix: "C:\\RHD_v1-1\\RHD_published_v2\\evaluation\\all_hand\\crop_gt_2d\\"
	 num_to_read: 42
  }
  include {
     phase: TEST
  }
}


#----- Read gt
layer {
  name: "read_gt_3d_read"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "gt_joint_3d_read"
  read_blob_from_file_indexing_param {
     file_prefix: "C:\\RHD_v1-1\\RHD_published_v2\\training\\all_hand\\gt_3d\\"
	 num_to_read: 63
  }
  include {
     phase: TRAIN
  }
}


#----- Read gt
layer {
  name: "read_gt_3d_read"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "gt_joint_3d_read"
  read_blob_from_file_indexing_param {
     file_prefix: "C:\\RHD_v1-1\\RHD_published_v2\\evaluation\\all_hand\\gt_3d\\"
	 num_to_read: 63
  }
  include {
     phase: TEST
  }
}



#-----gt 3d vector / 1000.0
layer {
  name: "gt_joint_3d"
  bottom: "gt_joint_3d_read"
  top: "gt_joint_3d"
  type: "ScaleVector"
  scale_vector_param {
    scale_factor: 0.001
  }
}

#------to compute scale for ground truth s 
layer {
  bottom: "gt_joint_3d"
  top: "gt_norm_scale"
  name: "gt_norm_scale"
  type: "DeepHandModelCalcNormScale"
}




#----slice to root and other joints root_RHD = 0
layer {
  name: "slice_gt_joint_3d"
  type: "Slice"
  bottom: "gt_joint_3d"
  top: "gt_root"
  top: "gt_other_joint"
  slice_param {
     axis: 1
	 slice_point: 3
  }
}

#---nothing
layer {
  bottom: "gt_other_joint"
  bottom: "gt_other_joint"
  top: "nothing_gt_other_joint"
  type: "EuclideanLoss"
  loss_weight: 0.0
}

#----take negative of gt root (3-d)
layer {
  bottom: "gt_root"
  top: "neg_gt_root"
  type: "ScaleVector"
  scale_vector_param {
    scale_factor: -1.0
  }
}

#-----slice gt_joint_3d to all 
layer {
  bottom: "gt_joint_3d"
  top: "gt_joint_3d_0_x"
  top: "gt_joint_3d_0_y"
  top: "gt_joint_3d_0_z"
  top: "gt_joint_3d_1_x"
  top: "gt_joint_3d_1_y"
  top: "gt_joint_3d_1_z"
  top: "gt_joint_3d_2_x"
  top: "gt_joint_3d_2_y"
  top: "gt_joint_3d_2_z"
  top: "gt_joint_3d_3_x"
  top: "gt_joint_3d_3_y"
  top: "gt_joint_3d_3_z"
  top: "gt_joint_3d_4_x"
  top: "gt_joint_3d_4_y"
  top: "gt_joint_3d_4_z"
  top: "gt_joint_3d_5_x"
  top: "gt_joint_3d_5_y"
  top: "gt_joint_3d_5_z"
  top: "gt_joint_3d_6_x"
  top: "gt_joint_3d_6_y"
  top: "gt_joint_3d_6_z"
  top: "gt_joint_3d_7_x"
  top: "gt_joint_3d_7_y"
  top: "gt_joint_3d_7_z"
  top: "gt_joint_3d_8_x"
  top: "gt_joint_3d_8_y"
  top: "gt_joint_3d_8_z"
  top: "gt_joint_3d_9_x"
  top: "gt_joint_3d_9_y"
  top: "gt_joint_3d_9_z"
  top: "gt_joint_3d_10_x"
  top: "gt_joint_3d_10_y"
  top: "gt_joint_3d_10_z"
  top: "gt_joint_3d_11_x"
  top: "gt_joint_3d_11_y"
  top: "gt_joint_3d_11_z"
  top: "gt_joint_3d_12_x"
  top: "gt_joint_3d_12_y"
  top: "gt_joint_3d_12_z"
  top: "gt_joint_3d_13_x"
  top: "gt_joint_3d_13_y"
  top: "gt_joint_3d_13_z"
  top: "gt_joint_3d_14_x"
  top: "gt_joint_3d_14_y"
  top: "gt_joint_3d_14_z"
  top: "gt_joint_3d_15_x"
  top: "gt_joint_3d_15_y"
  top: "gt_joint_3d_15_z"
  top: "gt_joint_3d_16_x"
  top: "gt_joint_3d_16_y"
  top: "gt_joint_3d_16_z"
  top: "gt_joint_3d_17_x"
  top: "gt_joint_3d_17_y"
  top: "gt_joint_3d_17_z"
  top: "gt_joint_3d_18_x"
  top: "gt_joint_3d_18_y"
  top: "gt_joint_3d_18_z"
  top: "gt_joint_3d_19_x"
  top: "gt_joint_3d_19_y"
  top: "gt_joint_3d_19_z"
  top: "gt_joint_3d_20_x"
  top: "gt_joint_3d_20_y"
  top: "gt_joint_3d_20_z"
  type: "Slice"
  slice_param {
     axis: 1
	 slice_point: 1
	 slice_point: 2
	 slice_point: 3
	 slice_point: 4
	 slice_point: 5
	 slice_point: 6
	 slice_point: 7
	 slice_point: 8
	 slice_point: 9
	 slice_point: 10
	 slice_point: 11
	 slice_point: 12
	 slice_point: 13
	 slice_point: 14
	 slice_point: 15
	 slice_point: 16
	 slice_point: 17
	 slice_point: 18
	 slice_point: 19
	 slice_point: 20
	 slice_point: 21
	 slice_point: 22
	 slice_point: 23
	 slice_point: 24
	 slice_point: 25
	 slice_point: 26
	 slice_point: 27
	 slice_point: 28
	 slice_point: 29
	 slice_point: 30
	 slice_point: 31
	 slice_point: 32
	 slice_point: 33
	 slice_point: 34
	 slice_point: 35
	 slice_point: 36
	 slice_point: 37
	 slice_point: 38
	 slice_point: 39
	 slice_point: 40
	 slice_point: 41
	 slice_point: 42
	 slice_point: 43
	 slice_point: 44
	 slice_point: 45
	 slice_point: 46
	 slice_point: 47
	 slice_point: 48
	 slice_point: 49
	 slice_point: 50
	 slice_point: 51
	 slice_point: 52
	 slice_point: 53
	 slice_point: 54
	 slice_point: 55
	 slice_point: 56
	 slice_point: 57
	 slice_point: 58
	 slice_point: 59
	 slice_point: 60
	 slice_point: 61
	 slice_point: 62
  } 
}

#----concat x component
layer {
  bottom: "gt_joint_3d_0_x"
  bottom: "gt_joint_3d_1_x"
  bottom: "gt_joint_3d_2_x"
  bottom: "gt_joint_3d_3_x"
  bottom: "gt_joint_3d_4_x"
  bottom: "gt_joint_3d_5_x"
  bottom: "gt_joint_3d_6_x"
  bottom: "gt_joint_3d_7_x"
  bottom: "gt_joint_3d_8_x"
  bottom: "gt_joint_3d_9_x"
  bottom: "gt_joint_3d_10_x"
  bottom: "gt_joint_3d_11_x"
  bottom: "gt_joint_3d_12_x"
  bottom: "gt_joint_3d_13_x"
  bottom: "gt_joint_3d_14_x"
  bottom: "gt_joint_3d_15_x"
  bottom: "gt_joint_3d_16_x"
  bottom: "gt_joint_3d_17_x"
  bottom: "gt_joint_3d_18_x"
  bottom: "gt_joint_3d_19_x"
  bottom: "gt_joint_3d_20_x"
  top: "gt_joint_3d_x"
  name: "gt_joint_3d_x"
  type: "Concat"
}



#----concat y component
layer {
  bottom: "gt_joint_3d_0_y"
  bottom: "gt_joint_3d_1_y"
  bottom: "gt_joint_3d_2_y"
  bottom: "gt_joint_3d_3_y"
  bottom: "gt_joint_3d_4_y"
  bottom: "gt_joint_3d_5_y"
  bottom: "gt_joint_3d_6_y"
  bottom: "gt_joint_3d_7_y"
  bottom: "gt_joint_3d_8_y"
  bottom: "gt_joint_3d_9_y"
  bottom: "gt_joint_3d_10_y"
  bottom: "gt_joint_3d_11_y"
  bottom: "gt_joint_3d_12_y"
  bottom: "gt_joint_3d_13_y"
  bottom: "gt_joint_3d_14_y"
  bottom: "gt_joint_3d_15_y"
  bottom: "gt_joint_3d_16_y"
  bottom: "gt_joint_3d_17_y"
  bottom: "gt_joint_3d_18_y"
  bottom: "gt_joint_3d_19_y"
  bottom: "gt_joint_3d_20_y"
  top: "gt_joint_3d_y"
  name: "gt_joint_3d_y"
  type: "Concat"
}


#----concat z component
layer {
  bottom: "gt_joint_3d_0_z"
  bottom: "gt_joint_3d_1_z"
  bottom: "gt_joint_3d_2_z"
  bottom: "gt_joint_3d_3_z"
  bottom: "gt_joint_3d_4_z"
  bottom: "gt_joint_3d_5_z"
  bottom: "gt_joint_3d_6_z"
  bottom: "gt_joint_3d_7_z"
  bottom: "gt_joint_3d_8_z"
  bottom: "gt_joint_3d_9_z"
  bottom: "gt_joint_3d_10_z"
  bottom: "gt_joint_3d_11_z"
  bottom: "gt_joint_3d_12_z"
  bottom: "gt_joint_3d_13_z"
  bottom: "gt_joint_3d_14_z"
  bottom: "gt_joint_3d_15_z"
  bottom: "gt_joint_3d_16_z"
  bottom: "gt_joint_3d_17_z"
  bottom: "gt_joint_3d_18_z"
  bottom: "gt_joint_3d_19_z"
  bottom: "gt_joint_3d_20_z"
  top: "gt_joint_3d_z"
  name: "gt_joint_3d_z"
  type: "Concat"
}


layer {
  type: "Slice"
  bottom: "neg_gt_root"
  top: "neg_gt_root_x"
  top: "neg_gt_root_y"
  top: "neg_gt_root_z"
  slice_param {
     axis: 1
	 slice_point: 1
	 slice_point: 2
  }
}

#---- minus root x to get rel x
layer {
  type: "AddVectorBySingleVector"
  bottom: "gt_joint_3d_x"
  bottom: "neg_gt_root_x"
  top: "gt_rel_x"
  name: "gt_rel_x"
}


#---- minus root y to get rel y
layer {
  type: "AddVectorBySingleVector"
  bottom: "gt_joint_3d_y"
  bottom: "neg_gt_root_y"
  top: "gt_rel_y"
  name: "gt_rel_y"
}


#---- minus root z to get rel z
layer {
  type: "AddVectorBySingleVector"
  bottom: "gt_joint_3d_z"
  bottom: "neg_gt_root_z"
  top: "gt_rel_z"
  name: "gt_rel_z"
}



#-----ignore gt rel 3d x & y (root-relative 3d w/o normed)
layer {
  bottom: "gt_rel_x"
  bottom: "gt_rel_y"
  top: "euc_gt_rel_xy"
  name: "euc_gt_rel_xy"
  type: "EuclideanLoss"
  loss_weight: 0.0
}

#----- zkr[j] * C / s

layer {
  bottom: "gt_rel_z"
  bottom: "gt_norm_scale"
  type: "ScaleVectorBySingleVector"
  top: "gt_rel_z_scale_norm"
  name: "gt_rel_z_scale_norm"
}


#---- + -minz
layer {
  type: "AddVectorByConstant"
  bottom: "gt_rel_z_scale_norm"
  
  top: "gt_rel_z_scale_norm_minus_minz"  
  name: "gt_rel_z_scale_norm_minus_minz"
  add_vector_by_constant_param {
    add_value: 0.326900 #- (-0.326900) 
  }
}

#----- / (maxz - minz)
layer {
  type: "ScaleVector"
  bottom: "gt_rel_z_scale_norm_minus_minz"  
  top: "gt_rel_z_scale_norm_minus_minz_scale"  
  name: "gt_rel_z_scale_norm_minus_minz_scale"  
  scale_vector_param {
    scale_factor:  1.529285823520416  #/ (0.6539)
  }
}






#---gen 56x56 heatmap gt
layer {
    bottom : "gt_joint_2d"
	top: "gt_56x56_hm"
	name: "gt_56x56_hm"
	type: "DeepHandModelGenHeatmapAllChannels"
	deep_hand_model_gen_heatmap_all_channels_param {
	   gen_size: 56
	   render_sigma: 0.08
	}

}


#---gen 28x28 heatmap gt
layer {
    bottom : "gt_joint_2d"
	top: "gt_28x28_hm"
	name: "gt_28x28_hm"
	type: "DeepHandModelGenHeatmapAllChannels"
	deep_hand_model_gen_heatmap_all_channels_param {
	   gen_size: 28
	   render_sigma: 0.08
	}

}



#---gen 14x14 heatmap gt
layer {
    bottom : "gt_joint_2d"
	top: "gt_14x14_hm"
	name: "gt_14x14_hm"
	type: "DeepHandModelGenHeatmapAllChannels"
	deep_hand_model_gen_heatmap_all_channels_param {
	   gen_size: 14
	   render_sigma: 0.08
	}

}

#---gen 7x7 heatmap gt
layer {
    bottom : "gt_joint_2d"
	top: "gt_7x7_hm"
	name: "gt_7x7_hm"
	type: "DeepHandModelGenHeatmapAllChannels"
	deep_hand_model_gen_heatmap_all_channels_param {
	   gen_size: 7
	   render_sigma: 0.08
	}

}

#-----generate ground truth "depth" map as in paper 
#--Hand Pose Estimation via Latent 2.5D Heatmap Representation
layer {
   type: "DeepHandModelGenDepthMap"
   bottom: "gt_56x56_hm"
   bottom: "gt_rel_z_scale_norm_minus_minz_scale"
   top: "gt_depth_map_56x56"
   name: "gt_depth_map_56x56"
   deep_hand_model_gen_depth_map_param {
      map_size: 56
	  joint_num: 21
	  depth_lower_bound: 0.0
	  depth_upper_bound: 1.0
   }
}

layer {
   type: "DeepHandModelGenDepthMap"
   bottom: "gt_28x28_hm"
   bottom: "gt_rel_z_scale_norm_minus_minz_scale"
   top: "gt_depth_map_28x28"
   name: "gt_depth_map_28x28"
   deep_hand_model_gen_depth_map_param {
      map_size: 28
	  joint_num: 21
	  depth_lower_bound: 0.0
	  depth_upper_bound: 1.0
   }
}

layer {
   type: "DeepHandModelGenDepthMap"
   bottom: "gt_14x14_hm"
   bottom: "gt_rel_z_scale_norm_minus_minz_scale"
   top: "gt_depth_map_14x14"
   name: "gt_depth_map_14x14"
   deep_hand_model_gen_depth_map_param {
      map_size: 14
	  joint_num: 21
	  depth_lower_bound: 0.0
	  depth_upper_bound: 1.0
   }
}

layer {
   type: "DeepHandModelGenDepthMap"
   bottom: "gt_7x7_hm"
   bottom: "gt_rel_z_scale_norm_minus_minz_scale"
   top: "gt_depth_map_7x7"
   name: "gt_depth_map_7x7"
   deep_hand_model_gen_depth_map_param {
      map_size: 7
	  joint_num: 21
	  depth_lower_bound: 0.0
	  depth_upper_bound: 1.0
   }
}

#-----concat ground truth latent heatmap and ground truth latent depth map
layer {
   bottom: "gt_56x56_hm"
   bottom: "gt_depth_map_56x56"
   top: "gt_56x56_ske_s1"
   name: "gt_56x56_ske_s1"
   type: "Concat"
}

layer {
   bottom: "gt_28x28_hm"
   bottom: "gt_depth_map_28x28"
   top: "gt_28x28_ske_s1"
   name: "gt_28x28_ske_s1"
   type: "Concat"
}

layer {
   bottom: "gt_14x14_hm"
   bottom: "gt_depth_map_14x14"
   top: "gt_14x14_ske_s1"
   name: "gt_14x14_ske_s1"
   type: "Concat"
}

layer {
   bottom: "gt_7x7_hm"
   bottom: "gt_depth_map_7x7"
   top: "gt_7x7_ske_s1"
   name: "gt_7x7_ske_s1"
   type: "Concat"
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "image"
  top: "conv1"
  convolution_param {
    num_output: 24
    pad: 1
    kernel_size: 3
    stride: 2
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv1_bn"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "conv1_bn"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TEST
  }
}

layer {
  name: "conv1_scale"
  bottom: "conv1"
  top: "conv1"
  type: "Scale"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "resx1_match_conv"
  type: "Pooling"
  bottom: "pool1"
  top: "resx1_match_conv"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "resx1_conv1"
  type: "Convolution"
  bottom: "pool1"
  top: "resx1_conv1"
  convolution_param {
    num_output: 54
    kernel_size: 1
    stride: 1
    pad: 0
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "resx1_conv1_bn"
  type: "BatchNorm"
  bottom: "resx1_conv1"
  top: "resx1_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "resx1_conv1_bn"
  type: "BatchNorm"
  bottom: "resx1_conv1"
  top: "resx1_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TEST
  }
}
layer {
  name: "resx1_conv1_scale"
  bottom: "resx1_conv1"
  top: "resx1_conv1"
  type: "Scale"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "resx1_conv1_relu"
  type: "ReLU"
  bottom: "resx1_conv1"
  top: "resx1_conv1"
}
layer {
  name: "resx1_conv2"
  type: "ConvolutionDepthwise"
  bottom: "resx1_conv1"
  top: "resx1_conv2"
  convolution_param {
    num_output: 54
    kernel_size: 3
    stride: 2
    pad: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "resx1_conv2_bn"
  type: "BatchNorm"
  bottom: "resx1_conv2"
  top: "resx1_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "resx1_conv2_bn"
  type: "BatchNorm"
  bottom: "resx1_conv2"
  top: "resx1_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TEST
  }
}

layer {
  name: "resx1_conv2_scale"
  bottom: "resx1_conv2"
  top: "resx1_conv2"
  type: "Scale"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "resx1_conv3"
  type: "Convolution"
  bottom: "resx1_conv2"
  top: "resx1_conv3"
  convolution_param {
    num_output: 216
    kernel_size: 1
    stride: 1
    pad: 0
    group: 3
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "resx1_conv3_bn"
  type: "BatchNorm"
  bottom: "resx1_conv3"
  top: "resx1_conv3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "resx1_conv3_bn"
  type: "BatchNorm"
  bottom: "resx1_conv3"
  top: "resx1_conv3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TEST
  }
}


layer {
  name: "resx1_conv3_scale"
  bottom: "resx1_conv3"
  top: "resx1_conv3"
  type: "Scale"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "resx1_concat"
  type: "Concat"
  bottom: "resx1_match_conv"
  bottom: "resx1_conv3"
  top: "resx1_concat"
}
layer {
  name: "resx1_concat_relu"
  type: "ReLU"
  bottom: "resx1_concat"
  top: "resx1_concat"
}
layer {
  name: "resx2_conv1"
  type: "Convolution"
  bottom: "resx1_concat"
  top: "resx2_conv1"
  convolution_param {
    num_output: 60
    kernel_size: 1
    stride: 1
    pad: 0
    group: 3
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "resx2_conv1_bn"
  type: "BatchNorm"
  bottom: "resx2_conv1"
  top: "resx2_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "resx2_conv1_bn"
  type: "BatchNorm"
  bottom: "resx2_conv1"
  top: "resx2_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TEST
  }
}
layer {
  name: "resx2_conv1_scale"
  bottom: "resx2_conv1"
  top: "resx2_conv1"
  type: "Scale"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "resx2_conv1_relu"
  type: "ReLU"
  bottom: "resx2_conv1"
  top: "resx2_conv1"
}
layer {
  name: "shuffle2"
  type: "ShuffleChannel"
  bottom: "resx2_conv1"
  top: "shuffle2"
  shuffle_channel_param {
    group: 3
  }
}
layer {
  name: "resx2_conv2"
  type: "ConvolutionDepthwise"
  bottom: "shuffle2"
  top: "resx2_conv2"
  convolution_param {
    num_output: 60
    kernel_size: 3
    stride: 1
    pad: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "resx2_conv2_bn"
  type: "BatchNorm"
  bottom: "resx2_conv2"
  top: "resx2_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "resx2_conv2_bn"
  type: "BatchNorm"
  bottom: "resx2_conv2"
  top: "resx2_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TEST
  }
}

layer {
  name: "resx2_conv2_scale"
  bottom: "resx2_conv2"
  top: "resx2_conv2"
  type: "Scale"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "resx2_conv3"
  type: "Convolution"
  bottom: "resx2_conv2"
  top: "resx2_conv3"
  convolution_param {
    num_output: 240
    kernel_size: 1
    stride: 1
    pad: 0
    group: 3
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "resx2_conv3_bn"
  type: "BatchNorm"
  bottom: "resx2_conv3"
  top: "resx2_conv3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "resx2_conv3_bn"
  type: "BatchNorm"
  bottom: "resx2_conv3"
  top: "resx2_conv3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TEST
  }
}
layer {
  name: "resx2_conv3_scale"
  bottom: "resx2_conv3"
  top: "resx2_conv3"
  type: "Scale"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "resx2_elewise"
  type: "Eltwise"
  bottom: "resx1_concat"
  bottom: "resx2_conv3"
  top: "resx2_elewise"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "resx2_elewise_relu"
  type: "ReLU"
  bottom: "resx2_elewise"
  top: "resx2_elewise"
}
layer {
  name: "resx3_conv1"
  type: "Convolution"
  bottom: "resx2_elewise"
  top: "resx3_conv1"
  convolution_param {
    num_output: 60
    kernel_size: 1
    stride: 1
    pad: 0
    group: 3
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "resx3_conv1_bn"
  type: "BatchNorm"
  bottom: "resx3_conv1"
  top: "resx3_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "resx3_conv1_bn"
  type: "BatchNorm"
  bottom: "resx3_conv1"
  top: "resx3_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TEST
  }
}
layer {
  name: "resx3_conv1_scale"
  bottom: "resx3_conv1"
  top: "resx3_conv1"
  type: "Scale"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "resx3_conv1_relu"
  type: "ReLU"
  bottom: "resx3_conv1"
  top: "resx3_conv1"
}
layer {
  name: "shuffle3"
  type: "ShuffleChannel"
  bottom: "resx3_conv1"
  top: "shuffle3"
  shuffle_channel_param {
    group: 3
  }
}
layer {
  name: "resx3_conv2"
  type: "ConvolutionDepthwise"
  bottom: "shuffle3"
  top: "resx3_conv2"
  convolution_param {
    num_output: 60
    kernel_size: 3
    stride: 1
    pad: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "resx3_conv2_bn"
  type: "BatchNorm"
  bottom: "resx3_conv2"
  top: "resx3_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "resx3_conv2_bn"
  type: "BatchNorm"
  bottom: "resx3_conv2"
  top: "resx3_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TEST
  }
}
layer {
  name: "resx3_conv2_scale"
  bottom: "resx3_conv2"
  top: "resx3_conv2"
  type: "Scale"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "resx3_conv3"
  type: "Convolution"
  bottom: "resx3_conv2"
  top: "resx3_conv3"
  convolution_param {
    num_output: 240
    kernel_size: 1
    stride: 1
    pad: 0
    group: 3
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "resx3_conv3_bn"
  type: "BatchNorm"
  bottom: "resx3_conv3"
  top: "resx3_conv3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "resx3_conv3_bn"
  type: "BatchNorm"
  bottom: "resx3_conv3"
  top: "resx3_conv3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TEST
  }
}
layer {
  name: "resx3_conv3_scale"
  bottom: "resx3_conv3"
  top: "resx3_conv3"
  type: "Scale"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "resx3_elewise"
  type: "Eltwise"
  bottom: "resx2_elewise"
  bottom: "resx3_conv3"
  top: "resx3_elewise"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "resx3_elewise_relu"
  type: "ReLU"
  bottom: "resx3_elewise"
  top: "resx3_elewise"
}
layer {
  name: "resx4_conv1"
  type: "Convolution"
  bottom: "resx3_elewise"
  top: "resx4_conv1"
  convolution_param {
    num_output: 60
    kernel_size: 1
    stride: 1
    pad: 0
    group: 3
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "resx4_conv1_bn"
  type: "BatchNorm"
  bottom: "resx4_conv1"
  top: "resx4_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "resx4_conv1_bn"
  type: "BatchNorm"
  bottom: "resx4_conv1"
  top: "resx4_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TEST
  }
}

layer {
  name: "resx4_conv1_scale"
  bottom: "resx4_conv1"
  top: "resx4_conv1"
  type: "Scale"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "resx4_conv1_relu"
  type: "ReLU"
  bottom: "resx4_conv1"
  top: "resx4_conv1"
}
layer {
  name: "shuffle4"
  type: "ShuffleChannel"
  bottom: "resx4_conv1"
  top: "shuffle4"
  shuffle_channel_param {
    group: 3
  }
}
layer {
  name: "resx4_conv2"
  type: "ConvolutionDepthwise"
  bottom: "shuffle4"
  top: "resx4_conv2"
  convolution_param {
    num_output: 60
    kernel_size: 3
    stride: 1
    pad: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "resx4_conv2_bn"
  type: "BatchNorm"
  bottom: "resx4_conv2"
  top: "resx4_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "resx4_conv2_bn"
  type: "BatchNorm"
  bottom: "resx4_conv2"
  top: "resx4_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TEST
  }
}
layer {
  name: "resx4_conv2_scale"
  bottom: "resx4_conv2"
  top: "resx4_conv2"
  type: "Scale"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "resx4_conv3"
  type: "Convolution"
  bottom: "resx4_conv2"
  top: "resx4_conv3"
  convolution_param {
    num_output: 240
    kernel_size: 1
    stride: 1
    pad: 0
    group: 3
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "resx4_conv3_bn"
  type: "BatchNorm"
  bottom: "resx4_conv3"
  top: "resx4_conv3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "resx4_conv3_bn"
  type: "BatchNorm"
  bottom: "resx4_conv3"
  top: "resx4_conv3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TEST
  }
}
layer {
  name: "resx4_conv3_scale"
  bottom: "resx4_conv3"
  top: "resx4_conv3"
  type: "Scale"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "resx4_elewise"
  type: "Eltwise"
  bottom: "resx3_elewise"
  bottom: "resx4_conv3"
  top: "resx4_elewise"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "resx4_elewise_relu"
  type: "ReLU"
  bottom: "resx4_elewise"
  top: "resx4_elewise"
}
layer {
  name: "resx5_match_conv"
  type: "Pooling"
  bottom: "resx4_elewise"
  top: "resx5_match_conv"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "resx5_conv1"
  type: "Convolution"
  bottom: "resx4_elewise"
  top: "resx5_conv1"
  convolution_param {
    num_output: 60
    kernel_size: 1
    stride: 1
    pad: 0
    group: 3
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "resx5_conv1_bn"
  type: "BatchNorm"
  bottom: "resx5_conv1"
  top: "resx5_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "resx5_conv1_bn"
  type: "BatchNorm"
  bottom: "resx5_conv1"
  top: "resx5_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TEST
  }
}
layer {
  name: "resx5_conv1_scale"
  bottom: "resx5_conv1"
  top: "resx5_conv1"
  type: "Scale"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "resx5_conv1_relu"
  type: "ReLU"
  bottom: "resx5_conv1"
  top: "resx5_conv1"
}
layer {
  name: "shuffle5"
  type: "ShuffleChannel"
  bottom: "resx5_conv1"
  top: "shuffle5"
  shuffle_channel_param {
    group: 3
  }
}
layer {
  name: "resx5_conv2"
  type: "ConvolutionDepthwise"
  bottom: "shuffle5"
  top: "resx5_conv2"
  convolution_param {
    num_output: 60
    kernel_size: 3
    stride: 2
    pad: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "resx5_conv2_bn"
  type: "BatchNorm"
  bottom: "resx5_conv2"
  top: "resx5_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "resx5_conv2_bn"
  type: "BatchNorm"
  bottom: "resx5_conv2"
  top: "resx5_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TEST
  }
}

layer {
  name: "resx5_conv2_scale"
  bottom: "resx5_conv2"
  top: "resx5_conv2"
  type: "Scale"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "resx5_conv3"
  type: "Convolution"
  bottom: "resx5_conv2"
  top: "resx5_conv3"
  convolution_param {
    num_output: 240
    kernel_size: 1
    stride: 1
    pad: 0
    group: 3
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "resx5_conv3_bn"
  type: "BatchNorm"
  bottom: "resx5_conv3"
  top: "resx5_conv3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "resx5_conv3_bn"
  type: "BatchNorm"
  bottom: "resx5_conv3"
  top: "resx5_conv3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TEST
  }
}

layer {
  name: "resx5_conv3_scale"
  bottom: "resx5_conv3"
  top: "resx5_conv3"
  type: "Scale"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "resx5_concat"
  type: "Concat"
  bottom: "resx5_match_conv"
  bottom: "resx5_conv3"
  top: "resx5_concat"
}
layer {
  name: "resx5_concat_relu"
  type: "ReLU"
  bottom: "resx5_concat"
  top: "resx5_concat"
}
layer {
  name: "resx6_conv1"
  type: "Convolution"
  bottom: "resx5_concat"
  top: "resx6_conv1"
  convolution_param {
    num_output: 120
    kernel_size: 1
    stride: 1
    pad: 0
    group: 3
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "resx6_conv1_bn"
  type: "BatchNorm"
  bottom: "resx6_conv1"
  top: "resx6_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "resx6_conv1_bn"
  type: "BatchNorm"
  bottom: "resx6_conv1"
  top: "resx6_conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TEST
  }
}

layer {
  name: "resx6_conv1_scale"
  bottom: "resx6_conv1"
  top: "resx6_conv1"
  type: "Scale"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "resx6_conv1_relu"
  type: "ReLU"
  bottom: "resx6_conv1"
  top: "resx6_conv1"
}
layer {
  name: "shuffle6"
  type: "ShuffleChannel"
  bottom: "resx6_conv1"
  top: "shuffle6"
  shuffle_channel_param {
    group: 3
  }
}
layer {
  name: "resx6_conv2"
  type: "ConvolutionDepthwise"
  bottom: "shuffle6"
  top: "resx6_conv2"
  convolution_param {
    num_output: 120
    kernel_size: 3
    stride: 1
    pad: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "resx6_conv2_bn"
  type: "BatchNorm"
  bottom: "resx6_conv2"
  top: "resx6_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TRAIN
  }
}
layer {
  name: "resx6_conv2_bn"
  type: "BatchNorm"
  bottom: "resx6_conv2"
  top: "resx6_conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TEST
  }
}

layer {
  name: "resx6_conv2_scale"
  bottom: "resx6_conv2"
  top: "resx6_conv2"
  type: "Scale"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "resx6_conv3"
  type: "Convolution"
  bottom: "resx6_conv2"
  top: "resx6_conv3"
  convolution_param {
    num_output: 480
    kernel_size: 1
    stride: 1
    pad: 0
    group: 3
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "resx6_conv3_bn"
  type: "BatchNorm"
  bottom: "resx6_conv3"
  top: "resx6_conv3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "resx6_conv3_bn"
  type: "BatchNorm"
  bottom: "resx6_conv3"
  top: "resx6_conv3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
       use_global_stats: false
  }
  include {
    phase: TEST
  }
}
layer {
  name: "resx6_conv3_scale"
  bottom: "resx6_conv3"
  top: "resx6_conv3"
  type: "Scale"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "resx6_elewise"
  type: "Eltwise"
  bottom: "resx5_concat"
  bottom: "resx6_conv3"
  top: "resx6_elewise"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "resx6_elewise_relu"
  type: "ReLU"
  bottom: "resx6_elewise"
  top: "resx6_elewise"
}
layer {
  name: "resx7_conv1"
  type: "Convolution"
  bottom: "resx6_elewise"
  top: "resx7_conv1"
  convolution_param {
    num_output: 120
    kernel_size: 1
    stride: 1
    pad: 0
    group: 3
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
